<?php

return [
    'success' => [
        'created' => 'مورد جدید ایجاد شد',
        'updated' => 'ویرایش با موفقیت انجام شد.',
        'deleted' => 'حذف با موفقیت انجام شد.',
        'sent' => 'ارسال با موفقیت انجام شد.',
        'saved' => 'ذخیره‌سازی با موفقیت انجام شد.',
        'completed' => 'عملیات با موفقیت انجام شد.',
        'retrieved' => 'اطلاعات با موفقیت بارگذاری شد.',
        'activated' => 'مورد با موفقیت فعال شد.',
        'deactivated' => 'مورد با موفقیت غیرفعال شد.',
    ],
    'error' => [
        'not_found' => 'موردی یافت نشد.',
        'unauthorized' => 'شما مجاز به انجام این عملیات نیستید.',
        'server' => 'خطایی در سرور رخ داده است. لطفاً بعداً امتحان کنید.',
        'validation' => 'لطفاً اطلاعات وارد شده را بررسی کنید.',
        'incurrect_input' => 'داده‌های ورودی صحیح نمی‌باشند.',
        'forbidden' => 'دسترسی شما به این عملیات محدود است.',
        'forbidden_route' => 'به این مسیر دسترسی ندارید',
        'timeout' => 'عملیات زمان‌بندی شده منقضی شده است. لطفاً دوباره امتحان کنید.',
        'conflict' => 'این عملیات با عملیات‌های دیگر تداخل دارد.',
        'repeated_subaccounting_doc_code' => 'کد تفصیلی تکراری می باشد',
        'invalid_company' => 'کمپانی نامشخص',
        'has_relation_to' => 'دارای روابط با:',
        'accountingsubcode_not_set' => 'کد تفصیلی ست نشده',
        'accountingsubcode_type_not_set' => 'نوع تولید تفصیلی ست نشده'

    ],
];
